In [6]:
import pandas as pd
data = pd.read_csv('udata.txt', sep='|')

In [8]:
data

       1  24  M     technician  85711
0      2  53  F          other  94043
1      3  23  M         writer  32067
2      4  24  M     technician  43537
3      5  33  F          other  15213
4      6  42  M      executive  98101
..   ...  .. ..            ...    ...
937  939  26  F        student  33319
938  940  32  M  administrator  02215
939  941  20  M        student  97229
940  942  48  F      librarian  78209
941  943  22  M        student  77841

[942 rows x 5 columns]

1. See the first 25 entries

In [15]:
# pd.read_csv('udata.txt', sep='|',nrows =  25)
first_25_entries = data.head(25)
first_25_entries

     1  24  M     technician  85711
0    2  53  F          other  94043
1    3  23  M         writer  32067
2    4  24  M     technician  43537
3    5  33  F          other  15213
4    6  42  M      executive  98101
5    7  57  M  administrator  91344
6    8  36  M  administrator  05201
7    9  29  M        student  01002
8   10  53  M         lawyer  90703
9   11  39  F          other  30329
10  12  28  F          other  06405
11  13  47  M       educator  29206
12  14  45  M      scientist  55106
13  15  49  F       educator  97301
14  16  21  M  entertainment  10309
15  17  30  M     programmer  06355
16  18  35  F          other  37212
17  19  40  M      librarian  02138
18  20  42  F      homemaker  95660
19  21  26  M         writer  30068
20  22  25  M         writer  40206
21  23  30  F         artist  48197
22  24  21  F         artist  94533
23  25  39  M       engineer  55107
24  26  49  M       engineer  21044

 See the last 10 entries

In [16]:

last_10_entries = data.tail(10)
last_10_entries

       1  24  M     technician  85711
932  934  61  M       engineer  22902
933  935  42  M         doctor  66221
934  936  24  M          other  32789
935  937  48  M       educator  98072
936  938  38  F     technician  55038
937  939  26  F        student  33319
938  940  32  M  administrator  02215
939  941  20  M        student  97229
940  942  48  F      librarian  78209
941  943  22  M        student  77841

 What is the number of observations in the dataset?

In [20]:
data.shape[0]  # 0 for number of rows and 1 for number of columns in a dataset

942

. What is the number of columns in the dataset?

In [21]:
data.shape[1]

5

5. Print the name of all the columns.

In [29]:
data.columns

Index(['1', '24', 'M', 'technician', '85711'], dtype='object')

6. How is the dataset indexed?

In [31]:
data.index

RangeIndex(start=0, stop=942, step=1)

7. What is the data type of each column?

In [35]:
data.dtypes

1              int64
24             int64
M             object
technician    object
85711         object
dtype: object

8. Print only the occupation column

In [41]:
data.loc[ : , 'technician']

0              other
1             writer
2         technician
3              other
4          executive
           ...
937          student
938    administrator
939          student
940        librarian
941          student
Name: technician, Length: 942, dtype: object

9.How many different occupations are in this dataset?

In [42]:
data['technician'].nunique()

21

10. What is the most frequent occupation?

In [43]:
data['technician'].value_counts().idxmax()

'student'

11. What is the mean age of users?

In [58]:
data.loc[ : , '24'].mean()

34.06263269639066

12. What is the age with least occurrence?

In [59]:
data['24'].value_counts().idxmin()

66